In [1]:
import pandas as pd
import numpy as np

In [2]:
a=pd.Series([1,2,3,4],['a','b','c','d'])

In [3]:
a

a    1
b    2
c    3
d    4
dtype: int64

In [13]:
df={'Person':['siri','hari','keeru','deepu'],'age':[23,22,21,21],'single':[True,False,True,False]}
df1=pd.DataFrame(df)

In [14]:
df1.values

array([['siri', 23, True],
       ['hari', 22, False],
       ['keeru', 21, True],
       ['deepu', 21, False]], dtype=object)

In [15]:
df1.columns

Index(['Person', 'age', 'single'], dtype='object')

In [17]:
df1.index

RangeIndex(start=0, stop=4, step=1)

In [20]:
df1=df1.set_index('Person')

In [53]:
df1

         age  single
Person
siri    23.0     1.0
hari     NaN     NaN
keeru   21.0     1.0
deepu    NaN     NaN

In [22]:
df1.index

Index(['siri', 'hari', 'keeru', 'deepu'], dtype='object', name='Person')

In [24]:
df1['single'].unique

<bound method Series.unique of Person
siri      True
hari     False
keeru     True
deepu    False
Name: single, dtype: bool>

In [25]:
df1['single'].unique()

array([ True, False])

In [27]:
df1['age'].unique()

array([23, 22, 21], dtype=int64)

In [28]:
df1.count()

age       4
single    4
dtype: int64

In [33]:
df1.count(axis="rows")

age       4
single    4
dtype: int64

In [34]:
df1.count(axis="columns")

Person
siri     2
hari     2
keeru    2
deepu    2
dtype: int64

In [35]:
a.count?

In [49]:
df1.iloc[3]=np.nan

In [50]:
df1

         age  single
Person
siri    23.0     1.0
hari    22.0     0.0
keeru   21.0     1.0
deepu    NaN     NaN

In [51]:
df1.loc['hari']=np.nan

In [52]:
df1

         age  single
Person
siri    23.0     1.0
hari     NaN     NaN
keeru   21.0     1.0
deepu    NaN     NaN

In [62]:
df1.loc['abc']=[np.nan,'34']

In [63]:
df1

        age single
Person
siri     23      1
hari    NaN    NaN
keeru    21      1
deepu   NaN    NaN
abc     NaN     34

In [64]:
df1.count(axis=0)

age       2
single    3
dtype: int64

In [65]:
df1.count(axis=1)

Person
siri     2
hari     0
keeru    2
deepu    0
abc      1
dtype: int64

In [67]:
df1.loc['hari'][-1]=20

In [68]:
df1

        age single
Person
siri     23      1
hari    NaN     20
keeru    21      1
deepu   NaN    NaN
abc     NaN     34

In [69]:
df1.reset_index()

  Person  age single
0   siri   23      1
1   hari  NaN     20
2  keeru   21      1
3  deepu  NaN    NaN
4    abc  NaN     34

In [74]:
df1

        age single
Person
siri     23      1
hari    NaN     20
keeru    21      1
deepu   NaN    NaN
abc     NaN     34

In [76]:
a=np.array([[1,2,3,4],[5,6,7]])

In [77]:
a

array([list([1, 2, 3, 4]), list([5, 6, 7])], dtype=object)

In [78]:
b=a.ravel()

In [79]:
b

array([list([1, 2, 3, 4]), list([5, 6, 7])], dtype=object)

In [80]:
b[1]=0

In [81]:
b

array([list([1, 2, 3, 4]), 0], dtype=object)

In [82]:
a

array([list([1, 2, 3, 4]), 0], dtype=object)

In [83]:
c=a.flatten()

In [84]:
c

array([list([1, 2, 3, 4]), 0], dtype=object)

In [85]:
c[1]=2

In [86]:
c

array([list([1, 2, 3, 4]), 2], dtype=object)

In [87]:
a

array([list([1, 2, 3, 4]), 0], dtype=object)